zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Eth/Std/IfxEth.h
/**
 * \file IfxEth.h
 * \brief ETH  basic functionality
 * \ingroup IfxLld_Eth
 *
 * \version iLLD_1_0_0_11_0
 * \copyright Copyright (c) 2013 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Eth_Std_DataStructures Data Structures
 * \ingroup IfxLld_Eth_Std
 * \defgroup IfxLld_Eth_Std_Unions Unions
 * \ingroup IfxLld_Eth_Std
 * \defgroup IfxLld_Eth_Std_Configuration Configuration Functions
 * \ingroup IfxLld_Eth_Std
 * \defgroup IfxLld_Eth_Std_Utility Utility Functions
 * \ingroup IfxLld_Eth_Std
 * \defgroup IfxLld_Eth_Std_Initialisation Initialisation Functions
 * \ingroup IfxLld_Eth_Std
 * \defgroup IfxLld_Eth_Std_Enum Enumerations
 * \ingroup IfxLld_Eth_Std
 */

#ifndef IFXET_H
#define IFXET_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "_Impl/IfxEth_cfg.h"
#include "Cpu/Std/Ifx_Types.h"
#include "IfxEth_reg.h"
#include "IfxEth_bf.h"
#include "_PinMap/IfxEth_PinMap.h"
#include "Src/Std/IfxSrc.h"
#include "Scu/Std/IfxScuWdt.h"
#include "_Utilities/Ifx_Assert.h"
#include "Cpu/Std/IfxCpu.h"

/******************************************************************************/
/*-----------------------------------Macros-----------------------------------*/
/******************************************************************************/

/** \brief Size of one ethernet frame buffer
 */
#ifndef IFXETH_RTX_BUFFER_SIZE
#define IFXETH_RTX_BUFFER_SIZE   1536
#endif

#ifndef IFXETH_TX_BUFFER_BY_USER
#define IFXETH_TX_BUFFER_BY_USER 0
#endif

#ifndef IFXETH_RX_BUFFER_BY_USER
#define IFXETH_RX_BUFFER_BY_USER 0
#endif

/** \brief Rx buffers (ring mode)
 */
#ifndef IFXETH_MAX_RX_BUFFERS
#define IFXETH_MAX_RX_BUFFERS    8
#endif

/** \brief Tx buffers (ring mode)
 */
#ifndef IFXETH_MAX_TX_BUFFERS
#define IFXETH_MAX_TX_BUFFERS    16
#endif

/** \brief 4 DWORDS (16 bytes)
 */
#define IFXETH_DESCR_SIZE        4

/******************************************************************************/
/*--------------------------------Enumerations--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Eth_Std_Enum
 * \{ */
typedef enum
{
    IfxEth_ChecksumMode_bypass            = 0,
    IfxEth_ChecksumMode_ipv4              = 1,
    IfxEth_ChecksumMode_tcpUdpIcmpSegment = 2,
    IfxEth_ChecksumMode_tcpUdpIcmpFull    = 3
} IfxEth_ChecksumMode;

/** \brief External Phy Interface RMII Mode
 */
typedef enum
{
    IfxEth_PhyInterfaceMode_mii,  /**< \brief MII mode */
    IfxEth_PhyInterfaceMode_rmii  /**< \brief RMII mode */
} IfxEth_PhyInterfaceMode;

/** \brief indicates the Receive DMA FSM state
 */
typedef enum
{
    IfxEth_ReceiveProcessState_reset,           /**< \brief Stopped: Reset or Stop Receive Command issued */
    IfxEth_ReceiveProcessState_fetching,        /**< \brief Running: Fetching Receive Transfer Descriptor */
    IfxEth_ReceiveProcessState_none,            /**< \brief Reserved for future use */
    IfxEth_ReceiveProcessState_waiting,         /**< \brief Running: Waiting for receive packet */
    IfxEth_ReceiveProcessState_suspended,       /**< \brief Suspended: Receive Descriptor Unavailable */
    IfxEth_ReceiveProcessState_closing,         /**< \brief Running: Closing Receive Descriptor */
    IfxEth_ReceiveProcessState_timestampWrite,  /**< \brief TIME_STAMP write state */
    IfxEth_ReceiveProcessState_transfering      /**< \brief Running: Transferring the receive packet data from receive buffer to host memory */
} IfxEth_ReceiveProcessState;

/** \brief indicates the Transmit DMA FSM state
 */
typedef enum
{
    IfxEth_TransmitProcessState_reset,           /**< \brief Stopped; Reset or Stop Transmit Command issued */
    IfxEth_TransmitProcessState_fetching,        /**< \brief Running; Fetching Transmit Transfer Descriptor */
    IfxEth_TransmitProcessState_waiting,         /**< \brief Running; Waiting for status */
    IfxEth_TransmitProcessState_reading,         /**< \brief Running; Reading Data from host memory buffer and queuing it to transmit buffer (Tx FIFO) */
    IfxEth_TransmitProcessState_timestampWrite,  /**< \brief TIME_STAMP write state */
    IfxEth_TransmitProcessState_none,            /**< \brief Reserved for future use */
    IfxEth_TransmitProcessState_suspended,       /**< \brief Suspended; Transmit Descriptor Unavailable or Transmit Buffer Underflow */
    IfxEth_TransmitProcessState_closing          /**< \brief Running; Closing Transmit Descriptor */
} IfxEth_TransmitProcessState;

/** \} */

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Eth_Std_DataStructures
 * \{ */
/** \brief Structure for Alternate/Enhanced RX descriptor DWORD 0 Bit field access
 */
typedef struct
{
    uint32 ext : 1;    /**< \brief Extended Status Available/Rx MAC Address */
    uint32 CE : 1;     /**< \brief CRC Error */
    uint32 DBE : 1;    /**< \brief Dribble Bit Error */
    uint32 RE : 1;     /**< \brief Receive Error */
    uint32 RWT : 1;    /**< \brief Receive Watchdog Timeout */
    uint32 FT : 1;     /**< \brief Frame Type */
    uint32 LC : 1;     /**< \brief Late Collision */
    uint32 IPC : 1;    /**< \brief IPC Checksum Error/Giant Frame */
    uint32 LS : 1;     /**< \brief Last Descriptor */
    uint32 FS : 1;     /**< \brief First Descriptor */
    uint32 VLAN : 1;   /**< \brief VLAN Tag */
    uint32 OE : 1;     /**< \brief Overflow Error */
    uint32 LE : 1;     /**< \brief Length Error */
    uint32 SAF : 1;    /**< \brief Source Address Filter Fail */
    uint32 DE : 1;     /**< \brief Descriptor Error */
    uint32 ES : 1;     /**< \brief Error Summary, ES = PCE | CE | RE | RWT | LC | IPC | OE | DE */
    uint32 FL : 14;    /**< \brief Frame Length */
    uint32 AFM : 1;    /**< \brief Destination Address Filter Fail */
    uint32 OWN : 1;    /**< \brief Own Bit, 1 = own by DMA */
} IfxEth_AltRxDescr0_Bits;

/** \brief Structure for Alternate/Enhanced RX descriptor DWORD 1 Bit field access
 */
typedef struct
{
    uint32 RBS1 : 13;   /**< \brief Receive Buffer 1 Size */
    uint32 resv1 : 1;   /**< \brief reserved */
    uint32 RCH : 1;     /**< \brief Second Address Chained */
    uint32 RER : 1;     /**< \brief Receive End of Ring */
    uint32 RBS2 : 13;   /**< \brief Receive Buffer 2 Size */
    uint32 resv : 2;    /**< \brief reserved) */
    uint32 DIC : 1;     /**< \brief Disable Interrupt on Completion */
} IfxEth_AltRxDescr1_Bits;

/** \brief Structure for Alternate/Enhanced TX descriptor DWORD 0 Bit field access
 */
typedef struct
{
    uint32 DB : 1;      /**< \brief Deferred bit */
    uint32 UF : 1;      /**< \brief Underflow error */
    uint32 ED : 1;      /**< \brief Excessive deferral */
    uint32 CC : 4;      /**< \brief Collision count */
    uint32 VLAN : 1;    /**< \brief VLAN TAG */
    uint32 EC : 1;      /**< \brief Excessive Collision */
    uint32 LC : 1;      /**< \brief Late Collision */
    uint32 NC : 1;      /**< \brief No Carrier */
    uint32 LOC : 1;     /**< \brief Loss of Carrier */
    uint32 PCE : 1;     /**< \brief Payload Checksum Error */
    uint32 FF : 1;      /**< \brief Frame Flushed */
    uint32 JT : 1;      /**< \brief Jabber Timeout */
    uint32 ES : 1;      /**< \brief Error Summary, ES = JT | FF | LOC | NC | LC | EC | ED | UF */
    uint32 IHE : 1;     /**< \brief IP Header Error */
    uint32 TTSS : 1;    /**< \brief Transmit Time Stamp Status */
    uint32 resv : 2;    /**< \brief (reserved) */
    uint32 TCH : 1;     /**< \brief Second Address Chained */
    uint32 TER : 1;     /**< \brief Transmit End of Ring */
    uint32 CIC : 2;     /**< \brief Checksum Insertion Control */
    uint32 resv1 : 1;   /**< \brief (Reserved) */
    uint32 TTSE : 1;    /**< \brief Transmit Time Stamp Enable */
    uint32 DP : 1;      /**< \brief Disable Padding */
    uint32 DC : 1;      /**< \brief Disable CRC */
    uint32 FS : 1;      /**< \brief First Segment */
    uint32 LS : 1;      /**< \brief Last Segment */
    uint32 IC : 1;      /**< \brief Interrupt on Completion */
    uint32 OWN : 1;     /**< \brief Own Bit, 1 = own by DMA */
} IfxEth_AltTxDescr0_Bits;

/** \brief Structure for Alternate/Enhanced TX descriptor DWORD 1 Bit field access
 */
typedef struct
{
    uint32 TBS1 : 13;   /**< \brief Transmit Buffer 1 Size */
    uint32 resv1 : 3;   /**< \brief (reserved) */
    uint32 TBS2 : 13;   /**< \brief Transmit Buffer 2 Size */
    uint32 resv2 : 3;   /**< \brief (reserved) */
} IfxEth_AltTxDescr1_Bits;

