zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Eth/Std/IfxEth.h
/** \} */

/** \addtogroup IfxLld_Eth_Std_Unions
 * \{ */
/** \brief Union for RX descriptor DWORD 0
 */
typedef union
{
    IfxEth_AltRxDescr0_Bits A;     /**< \brief Structure for RX descriptor DWORD 0 Bit field access */
    uint32                  U;     /**< \brief Unsigned long access */
} IfxEth_RxDescr0;

/** \brief Union for RX descriptor DWORD 1
 */
typedef union
{
    IfxEth_AltRxDescr1_Bits A;     /**< \brief Structure for RX descriptor DWORD 1 Bit field access */
    uint32                  U;     /**< \brief unsigned long access */
} IfxEth_RxDescr1;

/** \brief Union for RX descriptor DWORD 2
 */
typedef union
{
    uint32 U;     /**< \brief unsigned long access */
} IfxEth_RxDescr2;

/** \brief Union for RX descriptor DWORD 3
 */
typedef union
{
    uint32 U;     /**< \brief unsigned long access */
} IfxEth_RxDescr3;

/** \brief Union for TX descriptor DWORD 0
 */
typedef union
{
    IfxEth_AltTxDescr0_Bits A;     /**< \brief Structure for TX descriptor DWORD 0 Bit field access */
    uint32                  U;     /**< \brief Unsigned long access */
} IfxEth_TxDescr0;

/** \brief Union for TX descriptor DWORD 1
 */
typedef union
{
    IfxEth_AltTxDescr1_Bits A;     /**< \brief Structure for RX descriptor DWORD 1 Bit field access */
    uint32                  U;     /**< \brief unsigned long access */
} IfxEth_TxDescr1;

/** \brief Union for TX descriptor DWORD 2
 */
typedef union
{
    uint32 U;     /**< \brief unsigned long access */
} IfxEth_TxDescr2;

/** \brief Union for TX descriptor DWORD 3
 */
typedef union
{
    uint32 U;     /**< \brief unsigned long access */
} IfxEth_TxDescr3;

/** \} */

/** \addtogroup IfxLld_Eth_Std_DataStructures
 * \{ */
/** \brief Normal RX descriptor
 */
typedef struct
{
    IfxEth_RxDescr0 RDES0;     /**< \brief RX descriptor DWORD 0 */
    IfxEth_RxDescr1 RDES1;     /**< \brief RX descriptor DWORD 1 */
    IfxEth_RxDescr2 RDES2;     /**< \brief RX descriptor DWORD 2 */
    IfxEth_RxDescr3 RDES3;     /**< \brief RX descriptor DWORD 3 */
} IfxEth_RxDescr;

/** \brief Normal TX descriptor
 */
typedef struct
{
    IfxEth_TxDescr0 TDES0;     /**< \brief TX descriptor DWORD 0 */
    IfxEth_TxDescr1 TDES1;     /**< \brief TX descriptor DWORD 1 */
    IfxEth_TxDescr2 TDES2;     /**< \brief TX descriptor DWORD 2 */
    IfxEth_TxDescr3 TDES3;     /**< \brief TX descriptor DWORD 3 */
} IfxEth_TxDescr;

/** \} */

/** \addtogroup IfxLld_Eth_Std_DataStructures
 * \{ */
/** \brief Port pins for MII mode configuration
 */
typedef struct
{
    IfxEth_Crs_In   *crs;       /**< \brief pointer to CRS input pin config */
    IfxEth_Col_In   *col;       /**< \brief pointer to COL input pin config */
    IfxEth_Txclk_In *txClk;     /**< \brief Pointer to TXCLK input pin config */
    IfxEth_Rxclk_In *rxClk;     /**< \brief Pointer to RXCLK input pin config */
    IfxEth_Rxdv_In  *rxDv;      /**< \brief Pointer to RXDV input pin config */
    IfxEth_Rxer_In  *rxEr;      /**< \brief Pointer to RXER input pin config */
    IfxEth_Rxd_In   *rxd0;      /**< \brief Pointer to RXD0 input pin config */
    IfxEth_Rxd_In   *rxd1;      /**< \brief Pointer to RXD1 input pin config */
    IfxEth_Rxd_In   *rxd2;      /**< \brief Pointer to RXD2 input pin config */
    IfxEth_Rxd_In   *rxd3;      /**< \brief Pointer to RXD3 input pin config */
    IfxEth_Txen_Out *txEn;      /**< \brief Pointer to TXEN output pin config */
    IfxEth_Txer_Out *txEr;      /**< \brief Pointer to TXER output pin config */
    IfxEth_Txd_Out  *txd0;      /**< \brief Pointer to TXD0 output pin config */
    IfxEth_Txd_Out  *txd1;      /**< \brief Pointer to TXD1 output pin config */
    IfxEth_Txd_Out  *txd2;      /**< \brief Pointer to TXD2 output pin config */
    IfxEth_Txd_Out  *txd3;      /**< \brief Pointer to TXD3 output pin config */
} IfxEth_MiiPins;

/** \brief Port pins for RMII mode configuration
 */
typedef struct
{
    IfxEth_Crsdv_In   *crsDiv;     /**< \brief pointer to CRSDIV input pin config */
    IfxEth_Refclk_In  *refClk;     /**< \brief Pointer to REFCLK input pin config */
    IfxEth_Rxd_In     *rxd0;       /**< \brief Pointer to RXD0 input pin config */
    IfxEth_Rxd_In     *rxd1;       /**< \brief Pointer to RXD1 input pin config */
    IfxEth_Mdc_Out    *mdc;        /**< \brief Pointer to MDC output pin config */
    IfxEth_Mdio_InOut *mdio;       /**< \brief Pointer to MDIO pin config */
    IfxEth_Txd_Out    *txd0;       /**< \brief Pointer to TXD0 output pin config */
    IfxEth_Txd_Out    *txd1;       /**< \brief Pointer to TXD1 output pin config */
    IfxEth_Txen_Out   *txEn;       /**< \brief Pointer to TXEN output pin config */
} IfxEth_RmiiPins;

/** \} */

/** \addtogroup IfxLld_Eth_Std_Unions
 * \{ */
typedef union
{
    IfxEth_RxDescr items[IFXETH_MAX_RX_BUFFERS];
    uint32         U[IFXETH_MAX_RX_BUFFERS][IFXETH_DESCR_SIZE];
} IfxEth_RxDescrList;

typedef union
{
    IfxEth_TxDescr items[IFXETH_MAX_TX_BUFFERS];
    uint32         U[IFXETH_MAX_TX_BUFFERS][IFXETH_DESCR_SIZE];
} IfxEth_TxDescrList;

/** \} */

/** \addtogroup IfxLld_Eth_Std_DataStructures
 * \{ */
/** \brief ETH configuration structure
 */
typedef struct
{
    uint8 macAddress[6];                          /**< \brief MAC address for the ethernet, should be unique in the network */
    uint32 (*phyInit)(void);                      /**< \brief Pointer to the transceiver init function */
    boolean (*phyLink)(void);                     /**< \brief Pointer to the transceiver link function */
    IfxEth_PhyInterfaceMode phyInterfaceMode;     /**< \brief Phy Interface mode */
    const IfxEth_RmiiPins  *rmiiPins;             /**< \brief Pointer to port pins configuration of RMII mode */
    const IfxEth_MiiPins   *miiPins;              /**< \brief Pointer to port pins configuration of MII mode */
    Ifx_Priority            isrPriority;          /**< \brief Interrupt service priority */
    IfxSrc_Tos              isrProvider;          /**< \brief Interrupt service provider */
    Ifx_ETH                *ethSfr;               /**< \brief Pointer to register base */
    IfxEth_RxDescrList     *rxDescr;              /**< \brief pointer to RX descriptor RAM */
    IfxEth_TxDescrList     *txDescr;              /**< \brief pointer to TX descriptor RAM */
} IfxEth_Config;

