zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Eth/Std/IfxEth.h
/** \} */

/** \addtogroup IfxLld_Eth_Std_DataStructures
 * \{ */
/** \brief ETH driver structure
 */
typedef struct
{
    Ifx_ETH_STATUS      status;         /**< \brief Intermediate variable to use register content in control structure */
    uint32              rxCount;        /**< \brief Number of frames received */
    uint32              txCount;        /**< \brief Number of frames transmitted */
    uint32              error;          /**< \brief Indicate an error has occurred during execution */
    sint32              isrRxCount;     /**< \brief Count of RX ISR */
    sint32              isrTxCount;     /**< \brief Count of TX ISR */
    sint32              txDiff;         /**< \brief Difference between isrTxCount and txCount */
    sint32              rxDiff;         /**< \brief Difference between isrRxCount and rxCount */
    sint32              isrCount;       /**< \brief count of all ISR */
    IfxEth_Config       config;         /**< \brief Copy of the configuration passed through IfxEth_init() */
    IfxEth_RxDescrList *rxDescr;        /**< \brief pointer to RX descriptor RAM */
    IfxEth_TxDescrList *txDescr;        /**< \brief pointer to TX descriptor RAM */
    IfxEth_RxDescr     *pRxDescr;
    IfxEth_TxDescr     *pTxDescr;
    Ifx_ETH            *ethSfr;         /**< \brief Pointer to register base */
} IfxEth;

/** \brief Structure for RX descriptor DWORD 0 Bit field access
 */
typedef struct
{
    uint32 PCE : 1;    /**< \brief Rx MAC Address/Payload Checksum Error */
    uint32 CE : 1;     /**< \brief CRC Error */
    uint32 DBE : 1;    /**< \brief Dribble Bit Error */
    uint32 RE : 1;     /**< \brief Receive Error */
    uint32 RWT : 1;    /**< \brief Receive Watchdog Timeout */
    uint32 FT : 1;     /**< \brief Frame Type */
    uint32 LC : 1;     /**< \brief Late Collision */
    uint32 IPC : 1;    /**< \brief IPC Checksum Error/Giant Frame */
    uint32 LS : 1;     /**< \brief Last Descriptor */
    uint32 FS : 1;     /**< \brief First Descriptor */
    uint32 VLAN : 1;   /**< \brief VLAN Tag */
    uint32 OE : 1;     /**< \brief Overflow Error */
    uint32 LE : 1;     /**< \brief Length Error */
    uint32 SAF : 1;    /**< \brief Source Address Filter Fail */
    uint32 DE : 1;     /**< \brief Descriptor Error */
    uint32 ES : 1;     /**< \brief Error Summary, ES = PCE | CE | RE | RWT | LC | IPC | OE | DE */
    uint32 FL : 14;    /**< \brief Frame Length */
    uint32 AFM : 1;    /**< \brief Destination Address Filter Fail */
    uint32 OWN : 1;    /**< \brief Own Bit, 1 = own by DMA */
} IfxEth_RxDescr0_Bits;

/** \brief Structure for RX descriptor DWORD 1 Bit field access
 */
typedef struct
{
    uint32 RBS1 : 11;   /**< \brief Receive Buffer 1 Size */
    uint32 RBS2 : 11;   /**< \brief Receive Buffer 2 Size */
    uint32 resv : 2;    /**< \brief (reserved) */
    uint32 RCH : 1;     /**< \brief Second Address Chained */
    uint32 RER : 1;     /**< \brief Receive End of Ring */
    uint32 resv2 : 5;   /**< \brief (reserved) */
    uint32 DIC : 1;     /**< \brief Disable Interrupt on Completion */
} IfxEth_RxDescr1_Bits;

/** \brief Structure for TX descriptor DWORD 0 Bit field access
 */
typedef struct
{
    uint32 DB : 1;      /**< \brief Deferred Bit */
    uint32 UF : 1;      /**< \brief Underflow Error */
    uint32 ED : 1;      /**< \brief Excessive Deferral */
    uint32 CC : 4;      /**< \brief Collision Count */
    uint32 VLAN : 1;    /**< \brief VLAN Tag */
    uint32 EC : 1;      /**< \brief Excessive Collision */
    uint32 LC : 1;      /**< \brief Late Collision */
    uint32 NC : 1;      /**< \brief No Carrier */
    uint32 LOC : 1;     /**< \brief Loss of Carrier */
    uint32 PCE : 1;     /**< \brief Payload Checksum Error */
    uint32 FF : 1;      /**< \brief Frame Flushed */
    uint32 JT : 1;      /**< \brief Jabber Timeout */
    uint32 ES : 1;      /**< \brief Error Summary, ES = JT | FF | LOC | NC | LC | EC | ED | UF */
    uint32 IHE : 1;     /**< \brief IP Header Error */
    uint32 TTSS : 1;    /**< \brief Tx Time Stamp Status */
    uint32 resv : 13;   /**< \brief (reserved) */
    uint32 OWN : 1;     /**< \brief Own Bit, 1 = own by DMA */
} IfxEth_TxDescr0_Bits;

/** \brief Structure for TX descriptor DWORD 1 Bit field access
 */
typedef struct
{
    uint32 TBS1 : 11;   /**< \brief Transmit Buffer 1 Size */
    uint32 TBS2 : 11;   /**< \brief Transmit Buffer 2 Size */
    uint32 TTSE : 1;    /**< \brief Transmit Time Stamp Enable */
    uint32 DP : 1;      /**< \brief Disable Padding */
    uint32 TCH : 1;     /**< \brief Second Address Chained */
    uint32 TER : 1;     /**< \brief Transmit End of Ring */
    uint32 DC : 1;      /**< \brief Disable CRC */
    uint32 CIC : 2;     /**< \brief Checksum Insertion Control */
    uint32 FS : 1;      /**< \brief First Segment */
    uint32 LS : 1;      /**< \brief Last Segment */
    uint32 IC : 1;      /**< \brief Interrupt on Completion */
} IfxEth_TxDescr1_Bits;

/** \} */

/** \addtogroup IfxLld_Eth_Std_Configuration
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Set buffer of an RX descriptor
 * \param descr descr Pointer to an RX descriptor
 * \param buffer pointer to buffer
 * \return None
 */
IFX_INLINE void IfxEth_RxDescr_setBuffer(IfxEth_RxDescr *descr, void *buffer);

/** \brief Get pointer to next TX descriptor
 * \param descr descr Pointer to a TX descriptor
 * \return next Tx descriptor
 */
IFX_INLINE IfxEth_TxDescr *IfxEth_TxDescr_getNext(IfxEth_TxDescr *descr);

/** \brief Return TRUE if a TX descriptor is available for setup
 * \param descr pointer to descriptor
 */
IFX_INLINE boolean IfxEth_TxDescr_isAvailable(IfxEth_TxDescr *descr);

/** \brief Set buffer of a TX descriptor
 * \param descr Entdescr Pointer to a TX descriptorer_String_here
 * \param buffer pointer to Buffer
 * \return None
 */
IFX_INLINE void IfxEth_TxDescr_setBuffer(IfxEth_TxDescr *descr, void *buffer);

/** \brief Applies the Software Reset
 * \param eth ETH driver structure
 * \return None
 */
IFX_INLINE void IfxEth_applySoftwareReset(IfxEth *eth);

/** \brief Clear receive interrupt request
 * \param eth ETH driver structure
 * \return None
 */
IFX_INLINE void IfxEth_clearRxInterrupt(IfxEth *eth);

/** \brief Clear transmit interrupt request
 * \param eth ETH driver structure
 * \return None
 */
IFX_INLINE void IfxEth_clearTxInterrupt(IfxEth *eth);

