zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Eth/Std/IfxEth.h
/** \brief Returns the status of Software Reset
 * \param eth ETH driver structure
 * \return Status
 */
IFX_INLINE boolean IfxEth_isSoftwareResetDone(IfxEth *eth);

/** \brief Sets the loopback mode
 * \param eth ETH driver structure
 * \param loopbackMode loopback mode enable/disbale
 * \return None
 */
IFX_INLINE void IfxEth_setLoopbackMode(IfxEth *eth, boolean loopbackMode);

/** \brief Sets the Phy Interface mode
 * \param eth ETH driver structure
 * \param mode Phy interface mode
 * \return None
 */
IFX_INLINE void IfxEth_setPhyInterfaceMode(IfxEth *eth, IfxEth_PhyInterfaceMode mode);

/** \brief Sets receive descriptor address
 * \param eth pointer to the ethernet module
 * \param address Address
 * \return None
 */
IFX_INLINE void IfxEth_setReceiveDescriptorAddress(Ifx_ETH *eth, void *address);

/** \brief Sets transmit descriptor address
 * \param eth pointer to the ethernet module
 * \param address Address
 * \return None
 */
IFX_INLINE void IfxEth_setTransmitDescriptorAddress(Ifx_ETH *eth, void *address);

/** \brief Waits for one TX buffer becomes available
 * \param eth ETH driver structure
 * retval non NULL_PTR TX buffer is available at the address pointed by the returned value
 * retval NULL_PTR TX buffer is busy.
 */
IFX_INLINE void *IfxEth_waitTransmitBuffer(IfxEth *eth);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Free the receive buffer, enabling it for the further reception
 * \param eth ETH driver structure
 * \return None
 */
IFX_EXTERN void IfxEth_freeReceiveBuffer(IfxEth *eth);

/** \brief Request to send the transmit buffer
 *
 * The transmit buffer is the last one specified by IfxEth_getTransmitBuffer()
 * \param eth ETH driver structure
 * \param len Length of the data put in the transmit buffer (in bytes)
 * \return None
 */
IFX_EXTERN void IfxEth_sendTransmitBuffer(IfxEth *eth, uint16 len);

/** \brief Sets the MAC address
 * \param eth ETH driver structure
 * \param macAddress MAC address
 * \return None
 */
IFX_EXTERN void IfxEth_setMacAddress(IfxEth *eth, const uint8 *macAddress);

/** \brief Start the receiver functions
 * \param eth ETH driver structure
 * \return None
 */
IFX_EXTERN void IfxEth_startReceiver(IfxEth *eth);

/** \brief writes the header format into buffrer
 * \param eth ETH driver structure
 * \param txBuffer pointer to tx buffer
 * \param destinationAddress pointer to destination address
 * \param sourceAddress pointer to source address
 * \param packetSize size of the packet
 * \return None
 */
IFX_EXTERN void IfxEth_writeHeader(IfxEth *eth, uint8 *txBuffer, uint8 *destinationAddress, uint8 *sourceAddress, uint32 packetSize);

/** \} */

/** \addtogroup IfxLld_Eth_Std_Utility
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Get pointer to next RX descriptor
 * \param descr descr Pointer to an RX descriptor
 * \return next RX descriptor
 */
IFX_INLINE IfxEth_RxDescr *IfxEth_RxDescr_getNext(IfxEth_RxDescr *descr);

/** \brief release RX descriptor
 * \param descr pointer to Rx descriptor
 * \return None
 */
IFX_INLINE void IfxEth_RxDescr_release(IfxEth_RxDescr *descr);

/** \brief Release a TX descriptor for transmit queue
 * \param descr Enter_String_herdescr Pointer to a TX descriptore
 * \return None
 */
IFX_INLINE void IfxEth_TxDescr_release(IfxEth_TxDescr *descr);

/** \brief Get pointer to actual RX descriptor
 * \param eth eth ETH driver structure
 */
IFX_INLINE IfxEth_RxDescr *IfxEth_getActualRxDescriptor(IfxEth *eth);

/**
 */
IFX_INLINE uint32 IfxEth_getActualRxIndex(IfxEth *eth);

/** \brief Get pointer to actual TX descriptor
 * \param eth eth ETH driver structure
 */
IFX_INLINE IfxEth_TxDescr *IfxEth_getActualTxDescriptor(IfxEth *eth);

/** \brief Get pointer to base RX descriptor
 * \param eth eth ETH driver structure
 */
IFX_INLINE IfxEth_RxDescr *IfxEth_getBaseRxDescriptor(IfxEth *eth);

/** \brief Get pointer to base TX descriptor
 * \param eth eth ETH driver structure
 */
IFX_INLINE IfxEth_TxDescr *IfxEth_getBaseTxDescriptor(IfxEth *eth);

/** \brief returns the status of th eloopback mode
 * \param eth ETH driver structure
 * \return Loop back mode status (TRUE / FALSE)
 */
IFX_INLINE boolean IfxEth_getLoopbackMode(IfxEth *eth);

/** \brief Returns pointer to the MAC address configured for this ETH
 * \param eth ETH driver structure
 */
IFX_INLINE void *IfxEth_getMacAddressPointer(IfxEth *eth);

/** \brief returns the Receive Process State
 * \param eth ETH driver structure
 * \return Receive Process State
 */
IFX_INLINE IfxEth_ReceiveProcessState IfxEth_getReceiveProcessState(IfxEth *eth);

/** \brief Returns length of the oldest available RX data
 * \param eth ETH driver structure
 * \return Data length
 */
IFX_INLINE uint16 IfxEth_getRxDataLength(IfxEth *eth);

/** \brief returns the Transmit Process State
 * \param eth ETH driver structure
 * \return Transmit Process State
 */
IFX_INLINE IfxEth_TransmitProcessState IfxEth_getTransmitProcessState(IfxEth *eth);

/** \brief Checks whether physical connection is active
 * \param eth ETH driver structure
 * \return retval zero Connection is inactive
 * retval non zero Connection is active
 */
IFX_INLINE boolean IfxEth_isLinkActive(IfxEth *eth);

/**
 * \param eth pointer to ETH driver structure
 */
IFX_INLINE boolean IfxEth_isRxChecksumError(IfxEth *eth);

/** \brief Checks whether one or more RX data is available
 * \param eth ETH driver structure
 * \return retval TRUE one or more RX data is available
 * retval FALSE no RX data is available
 */
IFX_INLINE boolean IfxEth_isRxDataAvailable(IfxEth *eth);

/** \brief Checks whether receive interrupt is requested
 * \param eth ETH driver structure
 * \return TRUE/FALSE
 */
IFX_INLINE boolean IfxEth_isRxInterrupt(IfxEth *eth);

/** \brief Checks whether transmit interrupt is requested
 * \param eth ETH driver structure
 * \return TRUE/FALSE
 */
IFX_INLINE boolean IfxEth_isTxInterrupt(IfxEth *eth);

/** \brief reads the status of all flags
 * \param eth ETH driver structure
 * \return None
 */
IFX_INLINE void IfxEth_readAllFlags(IfxEth *eth);

