zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Eth/Std/IfxEth.h
/** \brief Shuffle to next RX descriptor
 * \param eth eth ETH driver structure
 * \return None
 */
IFX_INLINE void IfxEth_shuffleRxDescriptor(IfxEth *eth);

/** \brief Shuffle to next TX descriptor
 * \param eth eth ETH driver structure
 * \return None
 */
IFX_INLINE void IfxEth_shuffleTxDescriptor(IfxEth *eth);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Enable ETH Module
 * \return None
 */
IFX_EXTERN void IfxEth_enableModule(void);

/** \brief Gets receive buffer\n
 * note: IfxEth_freeReceiveBuffer() shall be called after the data from the RX buffer has been processed
 * \param eth ETH driver structure
 * \return retval NULL_PTR no received frame
 * retval !NULL_PTR a frame has been received
 */
IFX_EXTERN void *IfxEth_getReceiveBuffer(IfxEth *eth);

/** \brief Get a free transmit buffer
 * \param eth ETH driver structure
 * \return retval NULL_PTR no free transmit buffer is available
 * retval !NULL_PTR a free transmit buffer is available
 */
IFX_EXTERN void *IfxEth_getTransmitBuffer(IfxEth *eth);

/** \brief Reads the MAC address from module register
 * \param eth ETH driver structure
 * \param macAddress MAC address
 * \return None
 */
IFX_EXTERN void IfxEth_readMacAddress(IfxEth *eth, uint8 *macAddress);

/** \brief resets Ethernet kernel
 * \return None
 */
IFX_EXTERN void IfxEth_resetModule(void);

/**
 * \param eth pointer to ETH driver structure
 * \param len length of buffer
 * \return None
 */
IFX_EXTERN void IfxEth_setAndSendTransmitBuffer(IfxEth *eth, void *buffer, uint16 len);

/** \brief Set up checksum Engine
 * \param eth eth ETH driver structure
 * \param mode specifies checksum mode
 * \return None
 */
IFX_EXTERN void IfxEth_setupChecksumEngine(IfxEth *eth, IfxEth_ChecksumMode mode);

/** \brief Start the transmitter functions
 * \param eth eth ETH driver structure
 * \return None
 */
IFX_EXTERN void IfxEth_startTransmitter(IfxEth *eth);

/** \brief Stop the transmitter functions
 * \param eth eth ETH driver structure
 * \return None
 */
IFX_EXTERN void IfxEth_stopTransmitter(IfxEth *eth);

/** \brief Wakeup the receiver functions
 * \param eth eth ETH driver structure
 * \return None
 */
IFX_EXTERN void IfxEth_wakeupReceiver(IfxEth *eth);

/** \brief Wakeup the transmitter functions
 * \param eth eth ETH driver structure
 * \return None
 */
IFX_EXTERN void IfxEth_wakeupTransmitter(IfxEth *eth);

/** \} */

/** \addtogroup IfxLld_Eth_Std_Initialisation
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Setup some properties of a TX descriptor
 * \param descr Enter_Sdescr Pointer to a TX descriptortring_here
 * \param length specifies length of transmit descriptor
 * \param firstSegment specifies first segment of frame
 * \param lastSegment specifies last segment of frame
 * \return None
 */
IFX_INLINE void IfxEth_TxDescr_setup(IfxEth_TxDescr *descr, uint16 length, boolean firstSegment, boolean lastSegment);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Initialises the driver
 * \param eth ETH driver structure
 * \param config ETH configuration structure
 * \return None
 */
IFX_EXTERN void IfxEth_init(IfxEth *eth, const IfxEth_Config *config);

/** \brief Initialises the configuration Structure
 * \param config ETH configuration structure
 * \param ethSfr Pointer to register base
 * \return None
 */
IFX_EXTERN void IfxEth_initConfig(IfxEth_Config *config, Ifx_ETH *ethSfr);

/** \brief Initialises the receive descriptors
 * \param eth ETH driver structure
 * \return None
 */
IFX_EXTERN void IfxEth_initReceiveDescriptors(IfxEth *eth);

/** \brief Initialises transmit descriptors
 * \param eth pointer to ETH driver structure
 * \return None
 */
IFX_EXTERN void IfxEth_initTransmitDescriptors(IfxEth *eth);

/** \brief Set up MII mode input pins
 * \param eth eth pointer to ETH driver structure
 * \param miiPins pin of port to be set
 * \return None
 */
IFX_EXTERN void IfxEth_setupMiiInputPins(IfxEth *eth, const IfxEth_MiiPins *miiPins);

/** \brief setup MII mode output pins
 * \param eth eth pointer to ETH driver structure
 * \param miiPins pin of port to be set
 * \return None
 */
IFX_EXTERN void IfxEth_setupMiiOutputPins(IfxEth *eth, const IfxEth_MiiPins *miiPins);

/** \brief Set up input pins
 * \param eth eth pointer to ETH driver structure
 * \param rmiiPins pin of port to be set
 * \return None
 */
IFX_EXTERN void IfxEth_setupRmiiInputPins(IfxEth *eth, const IfxEth_RmiiPins *rmiiPins);

/** \brief set output pin of port
 * \param eth eth pointer to ETH driver structure
 * \param rmiiPins pin of port to be set
 * \return None
 */
IFX_EXTERN void IfxEth_setupRmiiOutputPins(IfxEth *eth, const IfxEth_RmiiPins *rmiiPins);

/** \} */

/******************************************************************************/
/*-------------------Global Exported Variables/Constants----------------------*/
/******************************************************************************/

/** \brief receive buffers
 */
IFX_EXTERN uint8              IfxEth_rxBuffer[IFXETH_MAX_RX_BUFFERS][IFXETH_RTX_BUFFER_SIZE];

IFX_EXTERN IfxEth_RxDescrList IfxEth_rxDescr;

/** \brief Transmit buffers
 */
IFX_EXTERN uint8              IfxEth_txBuffer[IFXETH_MAX_TX_BUFFERS][IFXETH_RTX_BUFFER_SIZE];

IFX_EXTERN IfxEth_TxDescrList IfxEth_txDescr;

/******************************************************************************/
/*---------------------Inline Function Implementations------------------------*/
/******************************************************************************/

IFX_INLINE IfxEth_RxDescr *IfxEth_RxDescr_getNext(IfxEth_RxDescr *descr)
{
    return (IfxEth_RxDescr *)(descr->RDES3.U);
}


IFX_INLINE void IfxEth_RxDescr_release(IfxEth_RxDescr *descr)
{
    descr->RDES0.A.OWN = 1U;
}


IFX_INLINE void IfxEth_RxDescr_setBuffer(IfxEth_RxDescr *descr, void *buffer)
{
    descr->RDES2.U = (uint32)IFXCPU_GLB_ADDR_DSPR(IfxCpu_getCoreId(), buffer);
}


IFX_INLINE IfxEth_TxDescr *IfxEth_TxDescr_getNext(IfxEth_TxDescr *descr)
{
    return (IfxEth_TxDescr *)(descr->TDES3.U);
}


IFX_INLINE boolean IfxEth_TxDescr_isAvailable(IfxEth_TxDescr *descr)
{
    return (descr->TDES0.A.OWN == 0) ? TRUE : FALSE;
}


IFX_INLINE void IfxEth_TxDescr_release(IfxEth_TxDescr *descr)
{
    descr->TDES0.A.OWN = 1U;
}


