zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Eth/Std/IfxEth.h
IFX_INLINE void IfxEth_TxDescr_setBuffer(IfxEth_TxDescr *descr, void *buffer)
{
    descr->TDES2.U = (uint32)IFXCPU_GLB_ADDR_DSPR(IfxCpu_getCoreId(), buffer);
}


IFX_INLINE void IfxEth_TxDescr_setup(IfxEth_TxDescr *descr, uint16 length, boolean firstSegment, boolean lastSegment)
{
    IfxEth_TxDescr0 tdes0;

    tdes0.U        = descr->TDES0.U;
    tdes0.A.FS     = firstSegment;
    tdes0.A.LS     = lastSegment;
    descr->TDES0.U = tdes0.U;
    descr->TDES1.U = length;
}


IFX_INLINE void IfxEth_applySoftwareReset(IfxEth *eth)
{
    (void)eth;
    ETH_BUS_MODE.B.SWR = 1; /* reset module */
}


IFX_INLINE void IfxEth_clearRxInterrupt(IfxEth *eth)
{
    (void)eth;
    MODULE_ETH.STATUS.U = (uint32)((1 << IFX_ETH_STATUS_NIS_OFF) | (1 << IFX_ETH_STATUS_RI_OFF));
}


IFX_INLINE void IfxEth_clearTxInterrupt(IfxEth *eth)
{
    (void)eth;
    MODULE_ETH.STATUS.U = (uint32)((1 << IFX_ETH_STATUS_NIS_OFF) | (1 << IFX_ETH_STATUS_TI_OFF));
}


IFX_INLINE IfxEth_RxDescr *IfxEth_getActualRxDescriptor(IfxEth *eth)
{
    return eth->pRxDescr;
}


IFX_INLINE uint32 IfxEth_getActualRxIndex(IfxEth *eth)
{
    uint32 offset = (uint32)eth->pRxDescr - (uint32)IfxEth_getBaseRxDescriptor(eth);
    return offset / sizeof(IfxEth_RxDescr);
}


IFX_INLINE IfxEth_TxDescr *IfxEth_getActualTxDescriptor(IfxEth *eth)
{
    return eth->pTxDescr;
}


IFX_INLINE IfxEth_RxDescr *IfxEth_getBaseRxDescriptor(IfxEth *eth)
{
    return eth->rxDescr->items;
}


IFX_INLINE IfxEth_TxDescr *IfxEth_getBaseTxDescriptor(IfxEth *eth)
{
    return eth->txDescr->items;
}


IFX_INLINE boolean IfxEth_getLoopbackMode(IfxEth *eth)
{
    (void)eth;
    return (ETH_MAC_CONFIGURATION.B.LM != 0) ? TRUE : FALSE;
}


IFX_INLINE void *IfxEth_getMacAddressPointer(IfxEth *eth)
{
    return (void *)eth->config.macAddress;
}


IFX_INLINE IfxEth_ReceiveProcessState IfxEth_getReceiveProcessState(IfxEth *eth)
{
    (void)eth;
    return (IfxEth_ReceiveProcessState)MODULE_ETH.STATUS.B.RS;
}


IFX_INLINE uint16 IfxEth_getRxDataLength(IfxEth *eth)
{
    uint16 length = 0;

    if (IfxEth_isRxDataAvailable(eth) != FALSE)
    {
        length = (uint16)IfxEth_getActualRxDescriptor(eth)->RDES0.A.FL;
    }

    return length;
}


IFX_INLINE IfxEth_TransmitProcessState IfxEth_getTransmitProcessState(IfxEth *eth)
{
    (void)eth;
    return (IfxEth_TransmitProcessState)MODULE_ETH.STATUS.B.TS;
}


IFX_INLINE boolean IfxEth_isLinkActive(IfxEth *eth)
{
    return eth->config.phyLink() != 0;
}


IFX_INLINE boolean IfxEth_isRxChecksumError(IfxEth *eth)
{
    IfxEth_RxDescr *descr = IfxEth_getActualRxDescriptor(eth);
    boolean         error = (descr->RDES0.A.IPC != 0);
    descr->RDES0.A.IPC = 0;

    return error;
}


IFX_INLINE boolean IfxEth_isRxDataAvailable(IfxEth *eth)
{
    //return (IfxEth_rxDescr[eth->rxIndex][0] & (1U << 31)) == 0);
    return IfxEth_getActualRxDescriptor(eth)->RDES0.A.OWN == 0;
}


IFX_INLINE boolean IfxEth_isRxInterrupt(IfxEth *eth)
{
    (void)eth;

    return MODULE_ETH.STATUS.B.RI != 0;
}


IFX_INLINE boolean IfxEth_isSoftwareResetDone(IfxEth *eth)
{
    (void)eth;
    return ETH_BUS_MODE.B.SWR == 0 ? 1 : 0;
}


IFX_INLINE boolean IfxEth_isTxInterrupt(IfxEth *eth)
{
    (void)eth;

    return MODULE_ETH.STATUS.B.TI != 0;
}


IFX_INLINE void IfxEth_readAllFlags(IfxEth *eth)
{
    eth->status.U = ETH_STATUS.U;
}


IFX_INLINE void IfxEth_setLoopbackMode(IfxEth *eth, boolean loopbackMode)
{
    (void)eth;
    ETH_MAC_CONFIGURATION.B.LM = loopbackMode ? 1 : 0;
}


IFX_INLINE void IfxEth_setPhyInterfaceMode(IfxEth *eth, IfxEth_PhyInterfaceMode mode)
{
    (void)eth;
    ETH_GPCTL.B.EPR = mode;
}


IFX_INLINE void IfxEth_setReceiveDescriptorAddress(Ifx_ETH *eth, void *address)
{
    eth->RECEIVE_DESCRIPTOR_LIST_ADDRESS.U = (uint32)address;
}


IFX_INLINE void IfxEth_setTransmitDescriptorAddress(Ifx_ETH *eth, void *address)
{
    eth->TRANSMIT_DESCRIPTOR_LIST_ADDRESS.U = (uint32)address;
}


IFX_INLINE void IfxEth_shuffleRxDescriptor(IfxEth *eth)
{
    eth->pRxDescr = IfxEth_RxDescr_getNext(eth->pRxDescr);
}


IFX_INLINE void IfxEth_shuffleTxDescriptor(IfxEth *eth)
{
    eth->pTxDescr = IfxEth_TxDescr_getNext(eth->pTxDescr);
}


IFX_INLINE void *IfxEth_waitTransmitBuffer(IfxEth *eth)
{
    void *tx;

    do
    {
        tx = IfxEth_getTransmitBuffer(eth);
    } while (tx == NULL_PTR);

    return tx;
}


#endif /* IFXET_H */
